<template>
  <section class="container mx-auto px-40">
    <header>
      <h2 class="m-4 font-bold text-xl	tracking-wide	">Обо мне</h2>
    </header>
    <main>
      <div class="text-base text-justify">
        <p class="mb-4">
          Приветствую Вас на моём сайте и давайте знакомиться.
        </p>
        <p class="mb-4">
          Меня зовут Савчук Янина Константиновна. В 2002 году окончила Уральскую государственную юридическую академию (в настоящее время-Уральский государственный юридический университет), специальность-юриспруденция. Стаж работы по специальности-18 лет. Имею опыт работы как в коммерческих организациях, так и в органах судебной власти, что позволяет мне оказывать квалифицированную юридическую помощь по широкому спектру правовых вопросов.
        </p>
        <p class="mb-4">
          Форму нашего взаимодействия Вы определяете самостоятельно, от консультирования до полного юридического сопровождения по вопросу обращения. При этом, важно помнить, основой любого продуктивного взаимодействия являются открытость и доверие, что позволяет с самого начала правильно оценить сложившуюся спорную ситуацию, расставить правильные приоритеты и ориентиры в работе и, как следствие, получить положительный (желаемый) результат.
        </p>
        <p class="mb-4">
          Со своей стороны, помимо квалифицированной юридической помощи, гарантирую индивидуальный подход в работе, конфиденциальность и порядочность.
        </p>
        <p class="mb-4">
          Записаться на консультацию Вы можете, позвонив по указанному на сайте номеру телефона, либо оставить сообщение с указанием Вашего имени и контактного номера телефона.
        </p>
        <p class="mb-4">
          Позвонить и договориться о встрече можно в рабочие дни с 09.00 до 20.00.
        </p>
        <p class="mb-4">
          В выходные и праздничные дни заявки принимаются посредством СМС-сообщений и\или WhatsApp сообщений с 12.00 до 20.00.
        </p>
        <p class="mb-4">
          Время проведения консультации в рабочие дни с 09.00 до 20.00, в выходные и праздничные дни-по договоренности.
        </p>
      </div>
    </main>
  </section>


</template>

<script>
export default {

}
</script>

<style scoped>

</style>