<template>
  <section class="container mx-auto px-40">
    <header>
      <h2 class="m-4 font-bold text-xl	tracking-wide	">Цены на предотавляемые услуги</h2>
    </header>
    <main>
      <ul class="text-justify">
        <li class="drop-shadow-md mb-2 bg-slate-200 hover:bg-slate-500 hover:text-white duration-200 cursor-pointer rounded-md p-6" v-for="item in priceItems" :key="item.id">
          <h3 class="mb-1 text-xl	font-bold	">{{item.title}}</h3>
          <hr class="mb-1">
          <p class="m-3 text-lg font-semibold italic">{{item.price}}</p>
          <p>{{item.additional}}</p>
          <hr class="mb-1">
          <p>{{item.subtitle}}</p>
        </li>
      </ul>
    </main>
  </section>
</template>

<script setup>
import {ref} from "vue";

const priceItems = ref([
  {
    title: "Консультирование по вопросам права",
    price: "2000 рублей (не более 2-х часов), каждый последующий час оплачивается дополнительно в сумме 500 рублей*",
    additional: "*При заключении договора на оказание юридических услуг консультирование по всем вопросам в рамках одного спора, в том числе, в рамках взаимосвязанных между собой требований, входит в стоимость юридического обслуживания и не требует дополнительной оплаты. \n",
    subtitle: "Целями консультирования являются выяснение фактических обстоятельств дела по вопросу обращения заказчика, исследование имеющихся в распоряжении заказчика документов, иных доказательств относительно существующего спора, разъяснение в соответствии с действующим законодательством РФ прав и обязанностей заказчика, оценка его правовых возможностей и определение порядка действий по защите его прав. \n",
    img_url: ""
  },
  {
    title: "Составление искового заявления",
    price: "10 000 рублей",
    subtitle: "Составление искового заявления включает себя консультирование, при необходимости, соблюдение досудебного порядка урегулирования спора, подготовку искового заявления с учётом требований действующего законодательства РФ, формирование полного комплекта документов для обращения в суд.",
    img_url: ""
  },
  {
    title: "Полное юридическое сопровождение спора",
    price: "20 000 рублей",
    subtitle: "В этом случае заказчика получает полный комплекс юридических услуг по вопросу обращения-консультирование, досудебное урегулирование спора в случаях, предусмотренных законом или договором, составление иска, его предъявление в суд, подготовка любых юридически значимых документов по делу (заявления, ходатайства), представление интересов заказчика в ходе судебного разбирательства в суде первой инстанции.",
    img_url: ""
  },
  {
    title: "Представительство интересов заказчика в суде",
    price: "5000 рублей за первое судебное заседание, 3000 рублей за каждое последующее судебное заседание*",
    additional: "*В том случае, если Вы решили прибегнуть к помощи юриста после предъявления искового заявления в суд или пришли к мнению о необходимости привлечь к участию в деле иного представителя, то данная форма взаимодействия актуальна именно для Вас.",
    subtitle: "",
    img_url: ""
  },
])
</script>