<template>
  <Navbar/>

  <section class="container mx-auto md:px-40 h-screen flex flex-col justify-start md:justify-center bg-[url('/img/3.JPG')] bg-image" id="main">
    <header class="ml-14 mt-8">
      <h1 class="text-4xl	md:text-7xl font-bold">Юридическая <br> компания <br> в Екатеринбурге</h1>
      <p class="text-xl md:text-4xl mt-4">Обеспечим полную защиту <br> ваших интересов</p>
    </header>
  </section>

  <hr class="m-4 border-2 w-1/2 mx-auto">

  <section class="container mx-auto px-4 md:px-40 mt-10" id="services">
    <header>
      <h2 class="m-4 font-bold text-xl	tracking-wide">Предмет деятельности</h2>
    </header>
    <main>
      <ul class="text-justify">
        <li class="drop-shadow-md mb-2 bg-slate-200 hover:bg-slate-500 hover:text-white duration-200 cursor-pointer rounded-md p-3" v-for="item in servicesItems" :key="item.id">
          <p>{{item.name}}</p>
        </li>
      </ul>
    </main>
  </section>

  <hr class="m-4 border-2 w-1/2 mx-auto">

  <section class="container mx-auto px-4 md:px-40 mt-10" id="price">
    <header>
      <h2 class="m-4 font-bold text-xl tracking-wide">Цены на предотавляемые услуги</h2>
    </header>
    <main>
      <ul class="text-justify">
        <li class="drop-shadow-md mb-2 bg-slate-200 hover:bg-slate-500 hover:text-white duration-200 cursor-pointer rounded-md p-6" v-for="item in priceItems" :key="item.id">
          <h3 class="mb-1 text-xl	font-bold	">{{item.title}}</h3>
          <hr class="mb-1">
          <p class="m-3 text-lg font-semibold italic">{{item.price}}</p>
          <p>{{item.additional}}</p>
          <hr class="mb-1">
          <p>{{item.subtitle}}</p>
        </li>
      </ul>
    </main>
  </section>

  <hr class="m-4 border-2 w-1/2 mx-auto mt-10">

  <section class="container mx-auto px-4 md:px-40" id="about">
    <header>
      <h2 class="m-4 font-bold text-xl tracking-wide">Обо мне</h2>
    </header>
    <main>
      <div class="text-base text-justify">
        <p class="mb-4">
          Приветствую Вас на моём сайте и давайте знакомиться.
        </p>
        <p class="mb-4">
          Меня зовут Савчук Янина Константиновна. В 2002 году окончила Уральскую государственную юридическую академию (в настоящее время-Уральский государственный юридический университет), специальность-юриспруденция. Стаж работы по специальности-18 лет. Имею опыт работы как в коммерческих организациях, так и в органах судебной власти, что позволяет мне оказывать квалифицированную юридическую помощь по широкому спектру правовых вопросов.
        </p>
        <p class="mb-4">
          Форму нашего взаимодействия Вы определяете самостоятельно, от консультирования до полного юридического сопровождения по вопросу обращения. При этом, важно помнить, основой любого продуктивного взаимодействия являются открытость и доверие, что позволяет с самого начала правильно оценить сложившуюся спорную ситуацию, расставить правильные приоритеты и ориентиры в работе и, как следствие, получить положительный (желаемый) результат.
        </p>
        <p class="mb-4">
          Со своей стороны, помимо квалифицированной юридической помощи, гарантирую индивидуальный подход в работе, конфиденциальность и порядочность.
        </p>
        <p class="mb-4">
          Записаться на консультацию Вы можете, позвонив по указанному на сайте номеру телефона, либо оставить сообщение с указанием Вашего имени и контактного номера телефона.
        </p>
        <p class="mb-4">
          Позвонить и договориться о встрече можно в рабочие дни с 09.00 до 20.00.
        </p>
        <p class="mb-4">
          В выходные и праздничные дни заявки принимаются посредством СМС-сообщений и\или WhatsApp сообщений с 12.00 до 20.00.
        </p>
        <p class="mb-4">
          Время проведения консультации в рабочие дни с 09.00 до 20.00, в выходные и праздничные дни-по договоренности.
        </p>
      </div>
    </main>
  </section>

  <hr class="m-4 border-2 w-1/2 mx-auto">

  <Footer/>
</template>

<script setup>
import Navbar from "./components/Navbar.vue";
import Footer from "./components/Footer.vue";
import {ref} from "vue";

const numbers = ref([
  {
    title: "17 000",
    subtitle: "Банкротов по РФ"
  },
  {
    title: "34",
    subtitle: "Филиала по РФ"
  },
  {
    title: "300",
    subtitle: "Юристов-экспертов в области банкротства"
  },
  {
    title: "50",
    subtitle: "Лучших арбитражных управляющих"
  }
])

const servicesItems = ref([
  {
    name: "Трудовые споры (нарушение трудовых прав, незаконное увольнение, иные трудовые споры);"
  },
  {
    name: "Споры о защите чести, достоинства и деловой репутации;"
  },
  {
    name: "Споры, вытекающие из договорного права (займ, кредит, неосновательное обогащение, подряд, иные виды договоров);"
  },
  {
    name: "Семейные споры (расторжение брака, раздел совместно нажитого имущества, алиментные обязательства, определение места жительства и порядка общения с детьми, лишение родительских прав, ограничение в родительских правах, иные семейные споры);"
  },
  {
    name: "Усыновление (удочерение) детей;"
  },
  {
    name: "Установление (оспаривание) отцовства;"
  },
  {
    name: "Установление опеки и попечительства над детьми;"
  },
  {
    name: "Наследственные споры."
  },
])

const priceItems = ref([
  {
    title: "Консультирование по вопросам права",
    price: "2000 рублей (не более 2-х часов), каждый последующий час оплачивается дополнительно в сумме 500 рублей*",
    additional: "*При заключении договора на оказание юридических услуг консультирование по всем вопросам в рамках одного спора, в том числе, в рамках взаимосвязанных между собой требований, входит в стоимость юридического обслуживания и не требует дополнительной оплаты. \n",
    subtitle: "Целями консультирования являются выяснение фактических обстоятельств дела по вопросу обращения заказчика, исследование имеющихся в распоряжении заказчика документов, иных доказательств относительно существующего спора, разъяснение в соответствии с действующим законодательством РФ прав и обязанностей заказчика, оценка его правовых возможностей и определение порядка действий по защите его прав. \n",
    img_url: ""
  },
  {
    title: "Составление искового заявления",
    price: "10 000 рублей",
    subtitle: "Составление искового заявления включает себя консультирование, при необходимости, соблюдение досудебного порядка урегулирования спора, подготовку искового заявления с учётом требований действующего законодательства РФ, формирование полного комплекта документов для обращения в суд.",
    img_url: ""
  },
  {
    title: "Полное юридическое сопровождение спора",
    price: "20 000 рублей",
    subtitle: "В этом случае заказчика получает полный комплекс юридических услуг по вопросу обращения-консультирование, досудебное урегулирование спора в случаях, предусмотренных законом или договором, составление иска, его предъявление в суд, подготовка любых юридически значимых документов по делу (заявления, ходатайства), представление интересов заказчика в ходе судебного разбирательства в суде первой инстанции.",
    img_url: ""
  },
  {
    title: "Представительство интересов заказчика в суде",
    price: "5000 рублей за первое судебное заседание, 3000 рублей за каждое последующее судебное заседание*",
    additional: "*В том случае, если Вы решили прибегнуть к помощи юриста после предъявления искового заявления в суд или пришли к мнению о необходимости привлечь к участию в деле иного представителя, то данная форма взаимодействия актуальна именно для Вас.",
    subtitle: "",
    img_url: ""
  },
])

</script>
